# Условие
# На вход подается число n.
# Задача
# Написать скрипт в любой парадигме, который выводит на экран таблицу умножения всех чисел от 1 до n.
# Обоснуйте выбор парадигм.



n = int(input("Введите число n:"))
for i in range(1, n):
    print("1 *", i, "=", i*1)

